In [1]:
import pandas as pd

In [2]:
asx_df = pd.read_csv("../Data/RawData/ASX_history.csv")
economy_df = pd.read_csv("../Data/RawData/Economy.csv")
aud_exchange_df = pd.read_csv("../Data/RawData/AUDexchange.csv")
cash_rate_df = pd.read_csv("../Data/RawData/CashRate.csv")
economy_df = pd.read_csv("../Data/RawData/Economy.csv")
employment_df = pd.read_csv("../Data/RawData/Employment.csv")
gdp_df = pd.read_csv("../Data/RawData/GDP.csv")
pop_df = pd.read_csv("../Data/RawData/Population.csv")

In [3]:
asx_df.head()

   Unnamed: 0       ASX
0  2000-10-02  2.043307
1  2000-10-03  2.169696
2  2000-10-04  2.001176
3  2000-10-05  2.022241
4  2000-10-06  2.148631

In [4]:
economy_df.head()

     Time  Net Savings  Total Use of Gross Income     GDP
0  Sep-59          589                       3493  3961.0
1  Dec-59          698                       3905  4070.0
2  Mar-60          225                       3310  4209.0
3  Jun-60           74                       3454  4324.0
4  Sep-60          492                       3669  4406.0

In [5]:
aud_exchange_df.head()

,Time,AUD_to_USD,AUD_to_EUR,AUD_to_GBP,AUD_to_JPY,AUD_to_CNY,AUD_to_KRW,AUD_to_CAD,AUD_to_INR
0,02-Jan-18,0.7837,0.6522,0.5799,88.33,5.0948,831.98,0.9824,49.92
1,03-Jan-18,0.7816,0.6485,0.5747,87.80,5.0842,832.76,0.9783,49.65
2,04-Jan-18,0.7835,0.6519,0.5795,88.27,5.0983,834.07,0.9820,49.76
3,05-Jan-18,0.7857,0.6508,0.5791,88.69,5.0916,834.37,0.9809,49.77
4,08-Jan-18,0.7842,0.6521,0.5784,88.78,5.0893,836.45,0.9726,49.64

In [6]:
cash_rate_df.head()

,Time,CashRate,InterbankOvernightCashRate,CashRate_ReturnTotalIndex
0,04-Jan-2011,4.75,4.75,100.013014
1,05-Jan-2011,4.75,4.75,100.026029
2,06-Jan-2011,4.75,4.75,100.039046
3,07-Jan-2011,4.75,4.75,100.078103
4,10-Jan-2011,4.75,4.75,100.091126

In [7]:
economy_df.head()

     Time  Net Savings  Total Use of Gross Income     GDP
0  Sep-59          589                       3493  3961.0
1  Dec-59          698                       3905  4070.0
2  Mar-60          225                       3310  4209.0
3  Jun-60           74                       3454  4324.0
4  Sep-60          492                       3669  4406.0

In [8]:
employment_df.head()

,Time,TotalEmployed,TotalEmployed_M,TotalEmployed_F,Employment_To_Population_Ratio,Employment_To_Population_Ratio_M,Employment_To_Population_Ratio_F,TotalUnemployed,TotalUnemployed_M,TotalUnemployed_F,Population 15 and over,Population 15 and over_M,Population 15 and over_F
0,Feb-78,5985.7,3887.4,2098.3,57.1,75.1,39.5,482.8,256.4,226.4,10489.3,5173.6,5315.7
1,Mar-78,6040.6,3900.6,2139.9,57.5,75.3,40.2,424.8,219.8,205.0,10508.6,5182.8,5325.8
2,Apr-78,6054.2,3899.1,2155.1,57.6,75.2,40.4,403.4,211.9,191.5,10518.7,5187.5,5331.2
3,May-78,6038.3,3888.6,2149.7,57.3,74.9,40.3,398.4,210.7,187.7,10530.7,5193.2,5337.5
4,Jun-78,6031.3,3883.6,2147.8,57.2,74.7,40.2,393.5,216.7,176.8,10543.4,5198.1,5345.3

In [9]:
gdp_new_df = gdp_df.iloc[3:]
gdp_new_df.rename(columns=gdp_new_df.iloc[0], inplace=True) 
gdp_new_df.drop(3, inplace=True)
gdp_new_df.head()

C:\Users\TribThapa\anaconda3\envs\pyvizenv\lib\site-packages\pandas\core\frame.py:4025: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  return super(DataFrame, self).rename(**kwargs)
C:\Users\TribThapa\anaconda3\envs\pyvizenv\lib\site-packages\pandas\core\frame.py:3940: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  errors=errors)

,Country Name,Country Code,Indicator Name,Indicator Code,1960.0,1961.0,1962.0,1963.0,1964.0,1965.0,...,2011.0,2012.0,2013.0,2014.0,2015.0,2016.0,2017.0,2018.0,2019.0,2020.0
4,Aruba,ABW,GDP growth (annual %),NY.GDP.MKTP.KD.ZG,NaN,NaN,NaN,NaN,NaN,NaN,...,3.446055,-1.369863,4.198232,0.300000,5.700001,2.100000,1.999999,NaN,NaN,NaN
5,Afghanistan,AFG,GDP growth (annual %),NY.GDP.MKTP.KD.ZG,NaN,NaN,NaN,NaN,NaN,NaN,...,0.426355,12.752287,5.600745,2.724543,1.451315,2.260314,2.647003,1.189228,3.911603,NaN
6,Angola,AGO,GDP growth (annual %),NY.GDP.MKTP.KD.ZG,NaN,NaN,NaN,NaN,NaN,NaN,...,3.471976,8.542188,4.954545,4.822628,0.943572,-2.580050,-0.147213,-2.003630,-0.624644,NaN
7,Albania,ALB,GDP growth (annual %),NY.GDP.MKTP.KD.ZG,NaN,NaN,NaN,NaN,NaN,NaN,...,2.545322,1.417526,1.001987,1.774487,2.218752,3.314805,3.802197,4.071301,2.240070,NaN
8,Andorra,AND,GDP growth (annual %),NY.GDP.MKTP.KD.ZG,NaN,NaN,NaN,NaN,NaN,NaN,...,-0.008070,-4.974444,-3.547597,2.504466,1.434140,3.709678,0.346072,1.588765,1.849238,NaN

In [10]:
pop_df.head()

,Time,Births,Deaths,NaturalIncreases,InterstateArrivals,OverseasArrivals,OverseasDepartures,NetOverseasDepartures,NetOverseasMigration,EstimatedResidentPopulation,PercenChangeOverThePreviousYear
0,Jun-1981,60.3,26.7,33.6,78.0,48.2,19.1,19.1,25.6,14923.3,NaN
1,Sep-1981,61.0,31.5,29.6,76.6,50.0,19.1,19.1,34.1,14988.7,NaN
2,Dec-1981,55.0,25.7,29.3,65.9,56.7,21.7,21.7,34.5,15054.1,NaN
3,Mar-1982,60.6,26.1,34.5,70.3,58.7,26.3,26.3,31.4,15121.7,NaN
4,Jun-1982,60.5,27.7,32.7,81.7,45.3,20.5,20.5,28.1,15184.2,1.75

## Get data only for June

In [11]:
economy_june_df = economy_df[economy_df.Time.str.match('Jun*')]

economy_june_df.to_csv("../Data/ProcessedData/Economy_JuneOnly.csv")

In [12]:
employment_june_df = employment_df[employment_df.Time.str.match('Jun*')]

employment_june_df.to_csv("../Data/ProcessedData/Employment_JuneOnly.csv")

In [13]:
gdp_selected_df = gdp_new_df.loc[(gdp_new_df["Country Name"] == "Australia") | 
                                 (gdp_new_df["Country Name"] == "Canada") |
                                 (gdp_new_df["Country Name"] == "China") |
                                 (gdp_new_df["Country Name"] == "European Union") |
                                 (gdp_new_df["Country Name"] == "India") |
                                 (gdp_new_df["Country Name"] == "Korea, Rep.") |
                                 (gdp_new_df["Country Name"] == "United Kingdom") |
                                 (gdp_new_df["Country Name"] == "United States")]

gdp_selected_df.to_csv("../Data/ProcessedData/GDP_selected_countries.csv")

In [14]:
pop_june_df = pop_df[pop_df.Time.str.match('Jun*')]

pop_june_df.to_csv("../Data/ProcessedData/Population_JuneOnly.csv")